app/views/devise/registrations/new.html.erb

SELECT "departaments".* FROM "departaments"
---
    <div class="input-field col s6">
    <%= f.select "departament_id", Departament.all.collect {|x| [x.name, x.id]},{}, class: "multiple"%>