app/views/notifications/new.html.erb

            <%= f.label :PQR %><br/>
            <%= f.select "pqr_id", Pqr.all.collect {|x| [x.description, x.id]},{}, class: "multiple"%>
---
SELECT "pqrs".* FROM "pqrs"

            <%= f.label :Usuario %><br/>
            <%= f.select "user_id", User.all.collect {|x| [x.username, x.id]},{}, class: "multiple"%>
---
SELECT "users".* FROM "users"