app/views/docs/edit.html.erb

SELECT "pqrs".* FROM "pqrs"
---
            <%= f.label :PQR %><br/>
            <%= f.select "pqr_id", Pqr.all.collect {|x| [x.description, x.id]},{}, class: "multiple"%>