app/views/pqrs/new.html.erb

SELECT "users".* FROM "users"
---
      <%= f.label :Usuario %><br/>
      <%= f.select "user_id", User.all.collect {|x| [x.username, x.id]},{}, class: "multiple"%>

SELECT "states".* FROM "states"
---
 <%= f.label :Estado %><br/>
 <%= f.select "state_id", State.all.collect {|x| [x.name, x.id]},{}, class: "multiple"%>