app/controllers/departaments_controller.rb

SELECT "departaments".* FROM "departaments"
---
    def index
    @departaments = Departament.all

INSERT INTO "departaments" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Admin1"], ["description", "Administrador"], ["created_at", "2018-05-18 21:48:45.476119"], ["updated_at", "2018-05-18 21:48:45.476119"]]
---
    def create
        @departament = Departament.new(departament_params)
            if @departament.save

SELECT  "departaments".* FROM "departaments" WHERE "departaments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def edit
        @departament = Departament.find(params[:id])

SELECT  "departaments".* FROM "departaments" WHERE "departaments"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "departaments" SET "description" = $1, "updated_at" = $2 WHERE "departaments"."id" = $3  [["description", "Ivan me la Jala muchoooooo"], ["updated_at", "2018-05-19 15:41:30.101920"], ["id", 3]]
---
    def update
        @departament = Departament.find(params[:id])
        if @departament.update(departament_params)

SELECT  "departaments".* FROM "departaments" WHERE "departaments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "departaments" WHERE "departaments"."id" = $1  [["id", 1]]
---
    def delete
        @departament = Departament.find(params[:id])
        @departament.destroy