app/controllers/docs_controller.rb

SELECT "docs".* FROM "docs"
---
    def index
    @docs = Doc.all

INSERT INTO "docs" ("pqr_id", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["pqr_id", 3], ["name", "jdkjdkjd"], ["created_at", "2018-05-24 06:44:23.179570"], ["updated_at", "2018-05-24 06:44:23.179570"]]
---
    def create
        @doc = Doc.new(doc_params)
            if @doc.save

UPDATE "docs" SET "name" = $1, "updated_at" = $2 WHERE "docs"."id" = $3  [["name", "jhgkjjbjbtttttttttttt"], ["updated_at", "2018-05-24 06:48:00.090155"], ["id", 2]]
---
    def update
        if @doc.update(doc_params)

DELETE FROM "docs" WHERE "docs"."id" = $1  [["id", 1]]
---
    def destroy
        @doc.destroy

SELECT  "docs".* FROM "docs" WHERE "docs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_doc
        @doc = Doc.find(params[:id])