app/controllers/notifications_controller.rb

    def index
    @notifications = Notification.all
---
SELECT "notifications".* FROM "notifications"

    def create
        @notification = Notification.new(notification_params)
            if @notification.save
---
INSERT INTO "notifications" ("message", "pqr_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["message", "Le llegó la notificacion"], ["pqr_id", 1], ["user_id", 3], ["created_at", "2018-05-24 06:26:14.228379"], ["updated_at", "2018-05-24 06:26:14.228379"]]

    def update
        if @notification.update(notification_params)
---
UPDATE "notifications" SET "message" = $1, "updated_at" = $2 WHERE "notifications"."id" = $3  [["message", "udddjjdyujuuuu"], ["updated_at", "2018-05-24 06:29:16.974151"], ["id", 2]]

    def destroy
        @notification.destroy
---
DELETE FROM "notifications" WHERE "notifications"."id" = $1  [["id", 1]]

    def set_notification
        @notification = Notification.find(params[:id])
---
SELECT  "notifications".* FROM "notifications" WHERE "notifications"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]