app/controllers/pqrs_controller.rb

    def index
    @pqrs = Pqr.all
---
SELECT "pqrs".* FROM "pqrs"

    def create
        @pqr = Pqr.new(pqr_params)
        if @pqr.save
---
INSERT INTO "pqrs" ("user_id", "name_1", "name_2", "last_name_1", "last_name_2", "email", "number", "date", "description", "state_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"

    def edit
        @pqr = Pqr.find(params[:id])
---
SELECT  "pqrs".* FROM "pqrs" WHERE "pqrs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def update
        @pqr = Pqr.find(params[:id])
        if @pqr.update(pqr_params)
---
SELECT  "pqrs".* FROM "pqrs" WHERE "pqrs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "pqrs" SET "state_id" = $1, "updated_at" = $2 WHERE "pqrs"."id" = $3  [["state_id", 4], ["updated_at", "2018-05-21 00:45:35.943528"], ["id", 1]]

    def destroy
        @pqr = Pqr.find(params[:id])
        @pqr.destroy
---
SELECT  "pqrs".* FROM "pqrs" WHERE "pqrs"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "pqrs" WHERE "pqrs"."id" = $1  [["id", 2]]