app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("pqr_id", "user_id", "comment", "date", "finished", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["pqr_id", 1], ["user_id", 3], ["comment", "jhahjhhjzjhhx"], ["date", "2018-05-18"], ["finished", "aja"], ["created_at", "2018-05-24 06:03:32.597118"], ["updated_at", "2018-05-24 06:03:32.597118"]]
---
    def create
    @review = Review.new(review_params)
    if @review.save