app/controllers/states_controller.rb

INSERT INTO "states" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Admin2"], ["description", "Este es el admin 2"], ["created_at", "2018-05-20 15:05:02.965076"], ["updated_at", "2018-05-20 15:05:02.965076"]]
---
    def create
    @state = State.new(state_params)
    if @state.save

SELECT  "states".* FROM "states" WHERE "states"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def edit
        @state = State.find params[:id]

SELECT  "states".* FROM "states" WHERE "states"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "states" SET "name" = $1, "description" = $2, "updated_at" = $3 WHERE "states"."id" = $4  [["name", "Revisadoqqqq"], ["description", "El PQR ha sido revisadoqqqqq"], ["updated_at", "2018-05-20 15:14:43.070292"], ["id", 1]]
---
    def update
        @state = State.find params[:id]
        if @state.update state_params

SELECT  "states".* FROM "states" WHERE "states"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "states" WHERE "states"."id" = $1  [["id", 2]]
---
    def destroy
    @state = State.find(params[:id])
    @state.destroy