app/views/reviews/new.html.erb

SELECT "users".* FROM "users"
---
      <%= f.label :Usuario %><br/>
      <%= f.select "user_id", User.all.collect {|x| [x.username, x.id]},{}, class: "multiple"%>

SELECT "pqrs".* FROM "pqrs"
---
        <%= f.label :Pqr %><br/>
        <%= f.select "pqr_id", Pqr.all.collect {|x| [x.description, x.id]},{}, class: "multiple"%>